In [25]:
import pandas as pd
import seaborn as sns

In [26]:
# LOADING DATA FROM SQL DATABASE AND MADE SOME MODIFICATION, AGAIN CREADTED DATAFRAMES:

In [27]:
import mysql.connector
from mysql.connector import Error

try:
    connection = mysql.connector.connect(
        host = "localhost",
        user = "root",
        password = "123456789",
        database = "phonepe"

    ) 
    if connection.is_connected():
        print("mysql coonection is SUCESSFUL!!!") 
    cursor = connection.cursor()
    print("Cursor Activated")
except Error as e:
    print("While connecting mysql ERROR!!!") 


 #why we need to close the connection because,if you maintain the connection live ,there is a cyber security we maintaion the records securely

mysql coonection is SUCESSFUL!!!
Cursor Activated

In [28]:
# modifying the columns and update the values as per our requirements and loading a data from the database again creating dataframe:
# agg_transaction:

# initially we set sql_safe_updates = 0 why because by default its 1:
query = "SET SQL_SAFE_UPDATES = 0"
cursor.execute(query)

# update states names :
query = """UPDATE agg_transaction 
           SET States = 'Andaman & Nicobar' 
           WHERE States = 'andaman-&-nicobar-islands'"""
cursor.execute(query)

query = """UPDATE agg_transaction 
           SET States ='Dadar Nagar Haveli' 
           WHERE States = 'dadra-&-nagar-haveli-&-daman-&-diu'"""
cursor.execute(query) 

# convert all states names into capitalizr format:
query = """UPDATE agg_transaction 
           SET States = CONCAT(UPPER(SUBSTRING(States,1,1)),LOWER(SUBSTRING(States,2,LENGTH(States))))"""
cursor.execute(query) 

# Removing '-' FROM the states column:
query = """UPDATE agg_transaction 
           SET States = REPLACE(States, '-', ' ')"""
cursor.execute(query)

# take the percentage two decimal point using ROUND() function:
query = """UPDATE agg_transaction 
           SET Transaction_amount = ROUND(Transaction_amount, 2)"""
cursor.execute(query)

# loading entire fron the table :
query = "SELECT * FROM agg_transaction"
cursor.execute(query)
table = cursor.fetchall()

# CREATING dataframe:
agg_transaction = pd.DataFrame(table, columns = ['States', 'Years', 'Quaters', 'Transaction_type', 'Transaction_count', 'Transaction_amount']) 

# again we set sql_safe_updats is 0:
query = "SET SQL_SAFE_UPDATES = 1"
cursor.execute(query)


connection.commit() 
agg_transaction

,States,Years,Quaters,Transaction_type,Transaction_count,Transaction_amount
0,Andaman & nicobar,2018,1,Recharge & bill payments,4200,1845307
1,Andaman & nicobar,2018,1,Peer-to-peer payments,1871,12138655
2,Andaman & nicobar,2018,1,Merchant payments,298,452507
3,Andaman & nicobar,2018,1,Financial Services,33,10601
4,Andaman & nicobar,2018,1,Others,256,184690
...,...,...,...,...,...,...
347341,West bengal,2024,4,Merchant payments,655100809,389286175909
347342,West bengal,2024,4,Peer-to-peer payments,493217788,1361927136312
347343,West bengal,2024,4,Recharge & bill payments,76043195,57534056540
347344,West bengal,2024,4,Financial Services,2352084,847296537
347345,West bengal,2024,4,Others,421806,505364108

In [29]:
# modifying the columns and update the values as per our requirements and loading a data from the database again creating dataframe:
# agg_user 

# initially we set sql_safe_updates = 0 why because by default its 1:
query = "SET SQL_SAFE_UPDATES = 0"
cursor.execute(query)

# update states names :
query = "UPDATE agg_user SET States = 'Andaman & Nicobar' WHERE States = 'andaman-&-nicobar-islands'"
cursor.execute(query)

query = "UPDATE agg_user SET States ='Dadar Nagar Haveli' WHERE States = 'dadra-&-nagar-haveli-&-daman-&-diu'"
cursor.execute(query) 

# convert all states names into capitalizr format:
query = "UPDATE agg_user SET States = CONCAT(UPPER(SUBSTRING(States,1,1)),LOWER(SUBSTRING(States,2,LENGTH(States))))"
cursor.execute(query) 

# Removing '-' FROM the states column:
query = "UPDATE agg_user SET States = REPLACE(States, '-', ' ')" 
cursor.execute(query)

# take the percentage two decimal point using ROUND() function:
query = "UPDATE agg_user SET Percentage = ROUND(Percentage,2)" 
cursor.execute(query) 

# loading entire fron the table :
query = "SELECT * FROM agg_user"
cursor.execute(query)
table = cursor.fetchall()

# CREATING dataframe:
agg_user = pd.DataFrame(table, columns = ['States', 'Years', 'Quaters', 'Brands', 'Transaction_count', 'Percentage']) 

# again we set sql_safe_updats is 0:
query = "SET SQL_SAFE_UPDATES = 1"
cursor.execute(query)


connection.commit() 
agg_user

,States,Years,Quaters,Brands,Transaction_count,Percentage
0,Andaman & nicobar,2018,1,Xiaomi,1665,0.25
1,Andaman & nicobar,2018,1,Samsung,1445,0.21
2,Andaman & nicobar,2018,1,Vivo,982,0.15
3,Andaman & nicobar,2018,1,Oppo,501,0.07
4,Andaman & nicobar,2018,1,OnePlus,332,0.05
...,...,...,...,...,...,...
430843,West bengal,2022,1,Lenovo,330017,0.02
430844,West bengal,2022,1,Infinix,284678,0.01
430845,West bengal,2022,1,Asus,280347,0.01
430846,West bengal,2022,1,Apple,277752,0.01
430847,West bengal,2022,1,Others,2196334,0.10

In [30]:
# modifying the columns and update the values as per our requirements and loading a data from the database again creating dataframe:
# agg_insurance 

# initially we set sql_safe_updates = 0 why because by default its 1:
query = "SET SQL_SAFE_UPDATES = 0"
cursor.execute(query)

# update states names :
query = """UPDATE agg_insurance 
           SET States = 'Andaman & Nicobar' 
           WHERE States = 'andaman-&-nicobar-islands'"""
cursor.execute(query)

query = """UPDATE agg_insurance 
           SET States ='Dadar Nagar Haveli' 
           WHERE States = 'dadra-&-nagar-haveli-&-daman-&-diu'"""
cursor.execute(query) 

# convert all states names into capitalizr format:
query = """UPDATE agg_insurance 
           SET States = CONCAT(UPPER(SUBSTRING(States,1,1)),LOWER(SUBSTRING(States,2,LENGTH(States))))"""
cursor.execute(query) 

# Removing '-' FROM the states column:
query = """UPDATE agg_insurance 
           SET States = REPLACE(States, '-', ' ')"""
cursor.execute(query)

# take the percentage two decimal point using ROUND() function:
query = """UPDATE agg_insurance 
           SET Transaction_amount = ROUND(Transaction_amount,2)""" 
cursor.execute(query) 

# loading entire fron the table :
query = "SELECT * FROM agg_insurance"
cursor.execute(query)
table = cursor.fetchall()

# CREATING dataframe:
agg_insurance = pd.DataFrame(table, columns = ['States', 'Years', 'Quaters', 'Transaction_type', 'Transaction_count', 'Transaction_amount']) 

# again we set sql_safe_updats is 0:
query = "SET SQL_SAFE_UPDATES = 1"
cursor.execute(query)


connection.commit()
agg_insurance

,States,Years,Quaters,Transaction_type,Transaction_count,Transaction_amount
0,Andaman & nicobar,2020,2,Insurance,6,1360.0
1,Andaman & nicobar,2020,3,Insurance,41,15380.0
2,Andaman & nicobar,2020,4,Insurance,124,157975.0
3,Andaman & nicobar,2021,1,Insurance,225,244266.0
4,Andaman & nicobar,2021,2,Insurance,137,181504.0
...,...,...,...,...,...,...
43643,West bengal,2023,4,Insurance,72712,100365562.0
43644,West bengal,2024,1,Insurance,79576,104987909.0
43645,West bengal,2024,2,Insurance,67048,89476633.0
43646,West bengal,2024,3,Insurance,77158,107451766.0
43647,West bengal,2024,4,Insurance,91719,120602777.0

In [31]:
# modifying the columns and update the values as per our requirements and loading a data from the database again creating dataframe:
# map_transaction:

# initially we set sql_safe_updates = 0 why because by default its 1:
query = "SET SQL_SAFE_UPDATES = 0"
cursor.execute(query)

# update states names :
query = """UPDATE map_transaction 
           SET States = 'Andaman & Nicobar Islands' 
           WHERE States = 'andaman-&-nicobar-islands'"""
cursor.execute(query)

query = """UPDATE map_transaction 
           SET States ='Dadar Nagar Haveli' 
           WHERE States = 'dadra-&-nagar-haveli-&-daman-&-diu'"""
cursor.execute(query) 

# convert all states names into capitalize format:
query = """UPDATE map_transaction 
           SET States = CONCAT(UPPER(SUBSTRING(States,1,1)),LOWER(SUBSTRING(States,2,LENGTH(States))))"""
cursor.execute(query) 

# convert all Districts names into capitalize format:
query = """UPDATE map_transaction 
           SET Districts = CONCAT(UPPER(SUBSTRING(Districts,1,1)),LOWER(SUBSTRING(Districts,2,LENGTH(Districts))))"""
cursor.execute(query) 

# Removing '-' FROM the states column:
query = """UPDATE map_transaction 
           SET States = REPLACE(States, '-', ' ')""" 
cursor.execute(query)

# take the Transaction_amount two decimal point using ROUND() function:
query = """UPDATE map_transaction 
           SET Transaction_amount = ROUND(Transaction_amount, 2)"""
cursor.execute(query)

# loading entire fron the table :
query = "SELECT * FROM map_transaction"
cursor.execute(query)
table = cursor.fetchall()

# CREATING dataframe:
map_transaction = pd.DataFrame(table, columns = ['States', 'Years', 'Quaters', 'Districts', 'Transaction_count', 'Transaction_amount']) 

# again we set sql_safe_updats is 0:
query = "SET SQL_SAFE_UPDATES = 1"
cursor.execute(query)


connection.commit() 
map_transaction

,States,Years,Quaters,Districts,Transaction_count,Transaction_amount
0,Andaman & nicobar islands,2018,1,North and middle andaman district,442,9.316631e+05
1,Andaman & nicobar islands,2018,1,South andaman district,5688,1.256025e+07
2,Andaman & nicobar islands,2018,1,Nicobars district,528,1.139849e+06
3,Andaman & nicobar islands,2018,2,North and middle andaman district,825,1.317863e+06
4,Andaman & nicobar islands,2018,2,South andaman district,9395,2.394824e+07
...,...,...,...,...,...,...
1298047,West bengal,2024,4,Alipurduar district,15875637,2.099251e+10
1298048,West bengal,2024,4,Paschim bardhaman district,56616799,6.968735e+10
1298049,West bengal,2024,4,Nadia district,65274337,1.079320e+11
1298050,West bengal,2024,4,Birbhum district,36905213,5.778701e+10
1298051,West bengal,2024,4,Purba medinipur district,67833775,1.142771e+11

In [32]:
# modifying the columns and update the values as per our requirements and loading a data from the database again creating dataframe:
# map_insurance 

# initially we set sql_safe_updates = 0 why because by default its 1:
query = "SET SQL_SAFE_UPDATES = 0"
cursor.execute(query)

# update states names :
query = """UPDATE map_insurance 
           SET States = 'Andaman & Nicobar' 
           WHERE States = 'andaman-&-nicobar-islands'"""
cursor.execute(query)

query = """UPDATE map_insurance 
           SET States ='Dadar Nagar Haveli' 
           WHERE States = 'dadra-&-nagar-haveli-&-daman-&-diu'"""
cursor.execute(query) 

# convert all states names into capitalizr format:
query = """UPDATE map_insurance 
           SET States = CONCAT(UPPER(SUBSTRING(States,1,1)),LOWER(SUBSTRING(States,2,LENGTH(States))))"""
cursor.execute(query) 

# convert all Districts names into capitalize format:
query = """UPDATE map_insurance 
           SET Districts = CONCAT(UPPER(SUBSTRING(Districts,1,1)),LOWER(SUBSTRING(Districts,2,LENGTH(Districts))))"""
cursor.execute(query) 

# Removing '-' FROM the states column:
query = """UPDATE map_insurance 
           SET States = REPLACE(States, '-', ' ')""" 
cursor.execute(query)

# Transaction amount converted to 2 decimal places:
query = """UPDATE map_insurance 
           SET Transaction_amount = ROUND(Transaction_amount, 2)"""
cursor.execute(query) 


# loading entire fron the table :
query = "SELECT * FROM map_insurance"
cursor.execute(query)
table = cursor.fetchall()

# CREATING dataframe:
map_insurance = pd.DataFrame(table, columns = ['States', 'Years', 'Quaters', 'Districts', 'Transaction_count', 'Transaction_amount']) 

# again we set sql_safe_updats is 0:
query = "SET SQL_SAFE_UPDATES = 1"
cursor.execute(query)


connection.commit() 
map_insurance

,States,Years,Quaters,Districts,Transaction_count,Transaction_amount
0,Andaman & nicobar,2020,2,South andaman district,3,795.0
1,Andaman & nicobar,2020,2,Nicobars district,3,565.0
2,Andaman & nicobar,2020,3,North and middle andaman district,1,281.0
3,Andaman & nicobar,2020,3,South andaman district,35,13651.0
4,Andaman & nicobar,2020,3,Nicobars district,5,1448.0
...,...,...,...,...,...,...
860307,West bengal,2024,4,Alipurduar district,1023,1613140.0
860308,West bengal,2024,4,Paschim bardhaman district,4945,7005850.0
860309,West bengal,2024,4,Nadia district,3807,5031290.0
860310,West bengal,2024,4,Birbhum district,1818,2423290.0
860311,West bengal,2024,4,Purba medinipur district,3559,4439060.0

In [33]:
# modifying the columns and update the values as per our requirements and loading a data from the database again creating dataframe:
# map_user 

# initially we set sql_safe_updates = 0 why because by default its 1:
query = "SET SQL_SAFE_UPDATES = 0"
cursor.execute(query)

# update states names :
query = """UPDATE map_user 
           SET States = 'Andaman & Nicobar' 
           WHERE States = 'andaman-&-nicobar-islands'"""
cursor.execute(query)

query = """UPDATE map_user 
           SET States ='Dadar Nagar Haveli' 
           WHERE States = 'dadra-&-nagar-haveli-&-daman-&-diu'"""
cursor.execute(query) 

# convert all states names into capitalizr format:
query = """UPDATE map_user 
           SET States = CONCAT(UPPER(SUBSTRING(States,1,1)),LOWER(SUBSTRING(States,2,LENGTH(States))))"""
cursor.execute(query) 

# convert all Districts names into capitalize format:
query = """UPDATE map_user 
           SET Districts = CONCAT(UPPER(SUBSTRING(Districts,1,1)),LOWER(SUBSTRING(Districts,2,LENGTH(Districts))))"""
cursor.execute(query) 

# Removing '-' FROM the states column:
query = "UPDATE map_user SET States = REPLACE(States, '-', ' ')" 
cursor.execute(query)


# loading entire fron the table :
query = "SELECT * FROM map_user"
cursor.execute(query)
table = cursor.fetchall()

# CREATING dataframe:
map_user = pd.DataFrame(table, columns = ['States', 'Years', 'Quaters', 'Districts', 'Register_users', 'App_opens_users']) 

# again we set sql_safe_updats is 0:
query = "SET SQL_SAFE_UPDATES = 1"
cursor.execute(query)


connection.commit() 
map_user

,States,Years,Quaters,Districts,Register_users,App_opens_users
0,Andaman & nicobar,2018,1,North and middle andaman district,632,0
1,Andaman & nicobar,2018,1,South andaman district,5846,0
2,Andaman & nicobar,2018,1,Nicobars district,262,0
3,Andaman & nicobar,2018,2,North and middle andaman district,911,0
4,Andaman & nicobar,2018,2,South andaman district,8143,0
...,...,...,...,...,...,...
1298299,West bengal,2024,4,Alipurduar district,475688,31842355
1298300,West bengal,2024,4,Paschim bardhaman district,1468252,80543469
1298301,West bengal,2024,4,Nadia district,1861738,98740305
1298302,West bengal,2024,4,Birbhum district,1114220,73465525
1298303,West bengal,2024,4,Purba medinipur district,1717074,108350777

In [34]:
# modifying the columns and update the values as per our requirements and loading a data from the database again creating dataframe:
# top_transaction 

# initially we set sql_safe_updates = 0 why because by default its 1:
query = "SET SQL_SAFE_UPDATES = 0"
cursor.execute(query)

# update states names :
query = """UPDATE top_transaction 
           SET States = 'Andaman & Nicobar' 
           WHERE States = 'andaman-&-nicobar-islands'"""
cursor.execute(query)

query = """UPDATE top_transaction 
           SET States ='Dadar Nagar Haveli' 
           WHERE States = 'dadra-&-nagar-haveli-&-daman-&-diu'"""
cursor.execute(query) 

# convert all states names into capitalizr format:
query = """UPDATE top_transaction 
           SET States = CONCAT(UPPER(SUBSTRING(States,1,1)),LOWER(SUBSTRING(States,2,LENGTH(States))))"""
cursor.execute(query) 

# Removing '-' FROM the states column:
query = "UPDATE top_transaction SET States = REPLACE(States, '-', ' ')" 
cursor.execute(query) 



# take the Transaction_amount two decimal point using ROUND() function:
query = "UPDATE top_transaction SET Transaction_amount = ROUND(Transaction_amount,2)" 
cursor.execute(query) 

# take the Pincodes without decimal point using ROUND() function:
query = """UPDATE top_transaction 
           SET Pincodes = FLOOR(Pincodes)""" 
cursor.execute(query)

# loading entire fron the table :
query = "SELECT * FROM top_transaction"
cursor.execute(query)
table = cursor.fetchall()

# CREATING dataframe:
top_transaction = pd.DataFrame(table, columns = ['States', 'Years', 'Quaters', 'Pincodes', 'Transaction_count', 'Transaction_amount']) 

# again we set sql_safe_updats is 0:
query = "SET SQL_SAFE_UPDATES = 1"
cursor.execute(query)


connection.commit() 
top_transaction

,States,Years,Quaters,Pincodes,Transaction_count,Transaction_amount
0,Andaman & nicobar,2018,1,744101,1622,2.769300e+06
1,Andaman & nicobar,2018,1,744103,1223,2.238040e+06
2,Andaman & nicobar,2018,1,744102,969,3.519060e+06
3,Andaman & nicobar,2018,1,744105,685,1.298560e+06
4,Andaman & nicobar,2018,1,744104,340,1.039720e+06
...,...,...,...,...,...,...
529942,West bengal,2024,4,711101,6753348,1.049480e+10
529943,West bengal,2024,4,700059,6662715,8.009480e+09
529944,West bengal,2024,4,700039,6575693,9.018750e+09
529945,West bengal,2024,4,734001,6432082,8.996530e+09
529946,West bengal,2024,4,733134,6313560,1.050260e+10

In [35]:
# modifying the columns and update the values as per our requirements and loading a data from the database again creating dataframe:
# top_user 

# initially we set sql_safe_updates = 0 why because by default its 1:
query = "SET SQL_SAFE_UPDATES = 0"
cursor.execute(query)

# update states names :
query = """UPDATE top_user 
           SET States = 'Andaman & Nicobar' 
           WHERE States = 'andaman-&-nicobar-islands'"""
cursor.execute(query)

query = """UPDATE top_user 
           SET States ='Dadar Nagar Haveli' 
           WHERE States = 'dadra-&-nagar-haveli-&-daman-&-diu'"""
cursor.execute(query) 

# convert all states names into capitalizr format:
query = """UPDATE top_user 
           SET States = CONCAT(UPPER(SUBSTRING(States,1,1)),LOWER(SUBSTRING(States,2,LENGTH(States))))"""
cursor.execute(query) 

# Removing '-' FROM the states column:
query = """UPDATE top_user 
           SET States = REPLACE(States, '-', ' ')""" 
cursor.execute(query) 

# loading entire fron the table :
query = "SELECT * FROM top_user"
cursor.execute(query)
table = cursor.fetchall()

# CREATING dataframe:
top_user = pd.DataFrame(table, columns = ['States', 'Years', 'Quaters', 'Pincodes', 'Register_users']) 

# again we set sql_safe_updats is 0:
query = "SET SQL_SAFE_UPDATES = 1"
cursor.execute(query)


connection.commit() 
top_user

                   States  Years  Quaters Pincodes  Register_users
0       Andaman & nicobar   2018        1   744103            1608
1       Andaman & nicobar   2018        1   744101            1108
2       Andaman & nicobar   2018        1   744105            1075
3       Andaman & nicobar   2018        1   744102            1006
4       Andaman & nicobar   2018        1   744104             272
...                   ...    ...      ...      ...             ...
559995        West bengal   2024        4   733134          169596
559996        West bengal   2024        4   700059          169448
559997        West bengal   2024        4   711302          146034
559998        West bengal   2024        4   700150          142151
559999        West bengal   2024        4   711106          142077

[560000 rows x 5 columns]

In [36]:
# modifying the columns and update the values as per our requirements and loading a data from the database again creating dataframe:
# top_insurance 

# initially we set sql_safe_updates = 0 why because by default its 1:
query = "SET SQL_SAFE_UPDATES = 0"
cursor.execute(query)

# update states names :
query = """UPDATE top_insurance 
           SET States = 'Andaman & Nicobar' 
           WHERE States = 'andaman-&-nicobar-islands'"""
cursor.execute(query)

query = """UPDATE top_insurance 
           SET States ='Dadar Nagar Haveli' 
           WHERE States = 'dadra-&-nagar-haveli-&-daman-&-diu'"""
cursor.execute(query) 

# convert all states names into capitalizr format:
query = """UPDATE top_insurance 
           SET States = CONCAT(UPPER(SUBSTRING(States,1,1)),LOWER(SUBSTRING(States,2,LENGTH(States))))"""
cursor.execute(query) 

# Removing '-' FROM the states column:
query = """UPDATE top_insurance 
           SET States = REPLACE(States, '-', ' ')""" 
cursor.execute(query) 

 
# loading entire fron the table :
query = "SELECT * FROM top_insurance"
cursor.execute(query)
table = cursor.fetchall()

# CREATING dataframe:
top_insurance = pd.DataFrame(table, columns = ['States', 'Years', 'Quaters', 'Pinci=', 'Count', 'Amount']) 

# again we set sql_safe_updats is 0:
query = "SET SQL_SAFE_UPDATES = 1"
cursor.execute(query)


connection.commit() 
top_insurance

                   States  Years  Quaters  Pinci=  Count    Amount
0       Andaman & nicobar   2020        2  744301      3     565.0
1       Andaman & nicobar   2020        2  744104      2     513.0
2       Andaman & nicobar   2020        2  744101      1     282.0
3       Andaman & nicobar   2020        3  744112      9    3432.0
4       Andaman & nicobar   2020        3  744105      7    3948.0
...                   ...    ...      ...     ...    ...       ...
400075        West bengal   2024        4  711101    713  750354.0
400076        West bengal   2024        4  700091    642  969634.0
400077        West bengal   2024        4  700150    627  761501.0
400078        West bengal   2024        4  700039    619  787836.0
400079        West bengal   2024        4  700156    574  888613.0

[400080 rows x 6 columns]